In [2]:
import pandas as pd

df_emdat = pd.read_excel("../data/raw/turkey_earthquakes_emdat.xlsx")

df_emdat.head()

,DisNo.,Historic,Classification Key,Disaster Group,Disaster Subgroup,Disaster Type,Disaster Subtype,External IDs,Event Name,ISO,...,Reconstruction Costs ('000 US$),"Reconstruction Costs, Adjusted ('000 US$)",Insured Damage ('000 US$),"Insured Damage, Adjusted ('000 US$)",Total Damage ('000 US$),"Total Damage, Adjusted ('000 US$)",CPI,Admin Units,Entry Date,Last Update
0,1924-0009-TUR,Yes,nat-geo-ear-gro,Natural,Geophysical,Earthquake,Ground movement,NaN,NaN,TUR,...,NaN,NaN,NaN,NaN,NaN,NaN,5.450419,NaN,2019-08-07,2023-09-25
1,1924-0011-TUR,Yes,nat-geo-ear-gro,Natural,Geophysical,Earthquake,Ground movement,NaN,NaN,TUR,...,NaN,NaN,NaN,NaN,NaN,NaN,5.450419,NaN,2019-08-07,2023-09-25
2,1925-0009-TUR,Yes,nat-geo-ear-gro,Natural,Geophysical,Earthquake,Ground movement,NaN,NaN,TUR,...,NaN,NaN,NaN,NaN,NaN,NaN,5.577915,NaN,2019-08-07,2023-09-25
3,1925-0013-TUR,Yes,nat-geo-ear-gro,Natural,Geophysical,Earthquake,Ground movement,NaN,NaN,TUR,...,NaN,NaN,NaN,NaN,NaN,NaN,5.577915,NaN,2019-08-07,2023-09-25
4,1928-0005-TUR,Yes,nat-geo-ear-gro,Natural,Geophysical,Earthquake,Ground movement,NaN,NaN,TUR,...,NaN,NaN,NaN,NaN,NaN,NaN,5.482293,NaN,2003-07-01,2023-09-25

In [3]:
df_emdat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110 entries, 0 to 109
Data columns (total 46 columns):
 #   Column                                     Non-Null Count  Dtype
---  ------                                     --------------  -----
 0   DisNo.                                     110 non-null    object
 1   Historic                                   110 non-null    object
 2   Classification Key                         110 non-null    object
 3   Disaster Group                             110 non-null    object
 4   Disaster Subgroup                          110 non-null    object
 5   Disaster Type                              110 non-null    object
 6   Disaster Subtype                           110 non-null    object
 7   External IDs                               26 non-null     object
 8   Event Name                                 0 non-null      float64
 9   ISO                                        110 non-null    object
 10  Country                                    110 non-null    object
 11  Subregion                                  110 non-null    object
 12  Region                                     110 non-null    object
 13  Location                                   106 non-null    object
 14  Origin                                     0 non-null      float64
 15  Associated Types                           8 non-null      object
 16  OFDA/BHA Response                          110 non-null    object
 17  Appeal                                     110 non-null    object
 18  Declaration                                110 non-null    object
 19  AID Contribution ('000 US$)                8 non-null      float64
 20  Magnitude                                  97 non-null     float64
 21  Magnitude Scale                            110 non-null    object
 22  Latitude                                   105 non-null    float64
 23  Longitude                                  105 non-null    float64
 24  River Basin                                1 non-null      float64
 25  Start Year                                 110 non-null    int64
 26  Start Month                                110 non-null    int64
 27  Start Day                                  110 non-null    int64
 28  End Year                                   110 non-null    int64
 29  End Month                                  110 non-null    int64
 30  End Day                                    110 non-null    int64
 31  Total Deaths                               90 non-null     float64
 32  No. Injured                                70 non-null     float64
 33  No. Affected                               48 non-null     float64
 34  No. Homeless                               28 non-null     float64
 35  Total Affected                             78 non-null     float64
 36  Reconstruction Costs ('000 US$)            3 non-null      float64
 37  Reconstruction Costs, Adjusted ('000 US$)  3 non-null      float64
 38  Insured Damage ('000 US$)                  5 non-null      float64
 39  Insured Damage, Adjusted ('000 US$)        5 non-null      float64
 40  Total Damage ('000 US$)                    26 non-null     float64
 41  Total Damage, Adjusted ('000 US$)          25 non-null     float64
 42  CPI                                        108 non-null    float64
 43  Admin Units                                29 non-null     object
 44  Entry Date                                 110 non-null    object
 45  Last Update                                110 non-null    object
dtypes: float64(19), int64(6), object(21)
memory usage: 39.7+ KB

In [6]:
columns_to_keep = [
    'Location',
    'Magnitude',
    'Latitude',
    'Longitude',
    'Start Year',
    'Start Month',
    'Start Day',
    'Total Deaths'
]

In [7]:
df_emdat = df_emdat[columns_to_keep]

In [8]:
df_emdat.info()
df_emdat.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110 entries, 0 to 109
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Location      106 non-null    object
 1   Magnitude     97 non-null     float64
 2   Latitude      105 non-null    float64
 3   Longitude     105 non-null    float64
 4   Start Year    110 non-null    int64
 5   Start Month   110 non-null    int64
 6   Start Day     110 non-null    int64
 7   Total Deaths  90 non-null     float64
dtypes: float64(4), int64(3), object(1)
memory usage: 7.0+ KB

,Location,Magnitude,Latitude,Longitude,Start Year,Start Month,Start Day,Total Deaths
0,Erzurum,5.3,39.700,42.800,1924,5,13,50.0
1,Erzurum,6.8,39.897,41.891,1924,9,13,60.0
2,Ardahan,5.8,41.200,42.800,1925,1,9,200.0
3,Dinar,5.9,38.000,30.500,1925,8,7,3.0
4,Torbah-Izmir,NaN,38.250,27.100,1928,3,30,50.0

In [ ]:
df_emdat[['Start Year','Start Month','Start Day']].isna().sum()

Start Year     0
Start Month    0
Start Day      0
dtype: int64

In [14]:
pd.to_datetime({
    'year': df_emdat['Start Year'],
    'month': df_emdat['Start Month'],
    'day': df_emdat['Start Day']
})

0     1924-05-13
1     1924-09-13
2     1925-01-09
3     1925-08-07
4     1928-03-30
         ...
105   2023-02-20
106   2023-02-27
107   2024-10-16
108   2025-04-23
109   2025-08-10
Length: 110, dtype: datetime64[ns]

In [15]:
df_emdat.head()

,Location,Magnitude,Latitude,Longitude,Start Year,Start Month,Start Day,Total Deaths
0,Erzurum,5.3,39.700,42.800,1924,5,13,50.0
1,Erzurum,6.8,39.897,41.891,1924,9,13,60.0
2,Ardahan,5.8,41.200,42.800,1925,1,9,200.0
3,Dinar,5.9,38.000,30.500,1925,8,7,3.0
4,Torbah-Izmir,NaN,38.250,27.100,1928,3,30,50.0

In [16]:
df_emdat['Date'] = pd.to_datetime({
    'year': df_emdat['Start Year'],
    'month': df_emdat['Start Month'],
    'day': df_emdat['Start Day'],
})

In [18]:
df_emdat.head()

,Location,Magnitude,Latitude,Longitude,Start Year,Start Month,Start Day,Total Deaths,Date
0,Erzurum,5.3,39.700,42.800,1924,5,13,50.0,1924-05-13
1,Erzurum,6.8,39.897,41.891,1924,9,13,60.0,1924-09-13
2,Ardahan,5.8,41.200,42.800,1925,1,9,200.0,1925-01-09
3,Dinar,5.9,38.000,30.500,1925,8,7,3.0,1925-08-07
4,Torbah-Izmir,NaN,38.250,27.100,1928,3,30,50.0,1928-03-30

In [19]:
df_emdat['Date'].isna().sum()

np.int64(0)

In [20]:
df_emdat = df_emdat.drop(columns=['Start Year', 'Start Month', 'Start Day'])

In [21]:
df_emdat.head()

       Location  Magnitude  Latitude  Longitude  Total Deaths       Date
0       Erzurum        5.3    39.700     42.800          50.0 1924-05-13
1       Erzurum        6.8    39.897     41.891          60.0 1924-09-13
2       Ardahan        5.8    41.200     42.800         200.0 1925-01-09
3         Dinar        5.9    38.000     30.500           3.0 1925-08-07
4  Torbah-Izmir        NaN    38.250     27.100          50.0 1928-03-30

In [22]:
# TÜM location temizliği
df_emdat['Location'] = (
    df_emdat['Location']
    .str.replace('Turkey:', '', regex=False)
    .str.replace('TURKEY:', '', regex=False)
    .str.replace('Province', '', regex=False)
    .str.replace('PROVINCE', '', regex=False)
    .str.replace('/', ' ', regex=False)
    .str.replace('-', ' ', regex=False)
    .str.replace(':', ' ', regex=False)
    .str.strip()
    .str.upper()
)

In [23]:
df_emdat['Location'] = (
    df_emdat['Location']
    .str.replace('EASTERN ANATOLIA REGION', 'EASTERN ANATOLIA', regex=False)
    .str.replace('CENTRAL ANATOLIA REGION', 'CENTRAL ANATOLIA', regex=False)
    .str.replace('MEDITERRANEAN REGION', 'AKDENIZ', regex=False)
    .str.replace('AEGEAN REGION', 'EGE', regex=False)
    .str.replace('BLACK SEA REGION', 'KARADENIZ', regex=False)
)

In [24]:
provinces = [
    "ADANA","ADIYAMAN","AFYONKARAHISAR","AGRI","AMASYA","ANKARA","ANTALYA","ARTVIN",
    "AYDIN","BALIKESIR","BILECIK","BINGOL","BITLIS","BOLU","BURDUR","BURSA",
    "CANAKKALE","CANKIRI","CORUM","DENIZLI","DIYARBAKIR","EDIRNE","ELAZIG","ERZINCAN",
    "ERZURUM","ESKISEHIR","GAZIANTEP","GIRESUN","GUMUSHANE","HAKKARI","HATAY","ISPARTA",
    "MERSIN","ISTANBUL","IZMIR","KARS","KASTAMONU","KAYSERI","KIRKLARELI","KIRSEHIR",
    "KOCAELI","KONYA","KUTAHYA","MALATYA","MANISA","KAHRAMANMARAS","MARDIN","MUGLA",
    "MUS","NEVSEHIR","NIGDE","ORDU","RIZE","SAKARYA","SAMSUN","SIIRT","SINOP",
    "SIVAS","TEKIRDAG","TOKAT","TRABZON","TUNCELI","SANLIURFA","USAK","VAN",
    "YOZGAT","ZONGULDAK","KARABUK","KILIS","OSMANIYE","DUZCE"
]

In [25]:
def extract_province(loc):
    for p in provinces:
        if p in loc:
            return p
    return loc   # Eğer il değilse olduğu gibi bırak

In [27]:
df_emdat['Location'] = df_emdat['Location'].astype(str).str.upper()

In [28]:
df_emdat['Location_clean'] = df_emdat['Location'].apply(extract_province)

In [30]:
df_emdat.head(100)

,Location,Magnitude,Latitude,Longitude,Total Deaths,Date,Location_clean
0,ERZURUM,5.3,39.7000,42.8000,50.0,1924-05-13,ERZURUM
1,ERZURUM,6.8,39.8970,41.8910,60.0,1924-09-13,ERZURUM
2,ARDAHAN,5.8,41.2000,42.8000,200.0,1925-01-09,ARDAHAN
3,DINAR,5.9,38.0000,30.5000,3.0,1925-08-07,DINAR
4,TORBAH IZMIR,NaN,38.2500,27.1000,50.0,1928-03-30,IZMIR
...,...,...,...,...,...,...,...
95,"TEKIRDAG, CANAKKALE PROVINCES",6.9,40.2893,25.3889,NaN,2014-05-24,CANAKKALE
96,BODRUM,6.7,NaN,NaN,NaN,2017-07-21,BODRUM
97,ISTANBUL,5.7,40.8900,28.1730,1.0,2019-09-26,ISTANBUL
98,SIVRICE DISTRICT (ELAZIG PROVINCE); MALATYA S),6.7,38.3900,44.3670,41.0,2020-01-24,ELAZIG
99,VAN CITY (BASKALE DISTRICT),5.8,38.5430,44.4470,9.0,2020-02-23,VAN

In [31]:
# 1) Eski Location sütununu sil
df_emdat = df_emdat.drop(columns=['Location'])

# 2) Location_clean sütununun adını Location yap
df_emdat = df_emdat.rename(columns={'Location_clean': 'Location'})

In [32]:
df_emdat.head(15)

,Magnitude,Latitude,Longitude,Total Deaths,Date,Location
0,5.3,39.700,42.800,50.0,1924-05-13,ERZURUM
1,6.8,39.897,41.891,60.0,1924-09-13,ERZURUM
2,5.8,41.200,42.800,200.0,1925-01-09,ARDAHAN
3,5.9,38.000,30.500,3.0,1925-08-07,DINAR
4,NaN,38.250,27.100,50.0,1928-03-30,IZMIR
5,NaN,37.919,40.211,100.0,1934-11-27,DIYARBAKIR
6,NaN,37.919,40.211,20.0,1934-12-15,DIYARBAKIR
7,6.1,39.300,40.600,540.0,1935-05-01,KIGI
8,6.6,39.508,33.872,149.0,1938-04-19,KIRSEHIR
9,5.9,39.700,10.400,13.0,1939-11-21,"ERZICAN, TERCAN REGION"
10,7.8,39.771,39.570,32962.0,1939-12-27,ERZINCAN
11,6.3,39.209,27.164,60.0,1939-09-22,DIKILI
12,NaN,38.400,35.500,37.0,1940-02-20,KAYSERI
13,6.0,41.700,43.800,16.0,1940-05-08,CIS
14,6.0,39.500,43.300,430.0,1941-09-11,VAN

In [33]:
df_emdat.to_csv('../data/cleaned/emdat_cleaned.csv', index=False)
df_emdat.to_excel('../data/cleaned/emdat_cleaned.xlsx', index=False)